{
  "clean_up_tokenization_spaces": false,
  "model_max_length": 4096,
  "tokenizer_class": "PreTrainedTokenizerFast",
  "chat_template": "{% for message in messages %}{% if message['role'] == 'user' %}User: {{ message['content'] }}\n{% elif message['role'] == 'assistant' %}Assistant: {{ message['content'] }}\n{% elif message['role'] == 'system' and message['content'] %}{{ message['content'] }}\n{% endif %}{% endfor %}{% if add_generation_prompt %}Assistant:{% endif %}"
}